''' Общие параметры '''
windowTitle = 'Угадай число' # имя окна приложения
windowWidth = 500 # ширина окна приложения
windowHeight = 380 # высота окна приложения

''' Цвета '''
color_titleText = "#45a049" # цвет текста титульной надписи
nameExit = 'Выход' # текст для кнопки выхода
color_bgButton = '#45a049' # цвет фона кнопок
color_textButton = "#ffffff" # цвет текста кнопок
color_hover_bgButton = "#bec5be" # цвет фона кнопок при наведении
color_hover_textButton = '#45a049' # цвет текста кнопок при наведении

''' Главное меню '''
labelTitleText = 'Добро пожаловать в игру \n"Угадай число"' # текст для титульной надписи
nameButtonModeUvC = 'Пользователь V Компьютер' # текст для первой кнопки
nameButtonModeUvU = 'Пользователь V Пользователь' # текст для второй кнопки

''' Компьютер против Пользователя '''
labelTitleText_UvC = 'Компьютер против Пользователя'
textRules_UvC = 'Компьютер загадывает число от 1 до 100.\nВаша задача отгадать его.\nУдачи!'
text_checkAnswerU = 'ОК'
text_go_to_menu = 'Назад'

''' Пользователь против Пользователя '''
labelTitleText_UvU = 'Пользователь против Пользователя'
textRules_UvU = 'Один игрок загадывает число.\nЗадача второго игрока отгадать его.\nУдачи!'
